Map<String, dynamic> mainDiseaseLanguage = {
  "1": {
    "diseaseTitle": "ไข้หวัด",
    "diseaseDetail": "การรักษา\n\n1. พักผ่อนให้เพียงพอ\n2. ดื่มน้ำให้มาก, ไม่ดื่มน้ำเย็น\n3. ทำให้ร่างกายอบอุ่น\n4. กินอาหารอ่อน\n5. ใช้น้ำอุ่นเช็ดตัวเมื่อมีไข้สูง\n6. ถ้ามีไข้ให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง\n7. ถ้ามีน้ำมูกให้ยา คลอเฟนิรามีน 1 เม็ด วันละ 3 ครั้งหลังอาหาร เมื่อทุเลาลงแล้วควรหยุดยา",
  },
  "2": {
    "diseaseTitle": "ไข้หวัดใหญ่",
    "diseaseDetail": "การรักษา\n\n1. พักผ่อนให้เพียงพอ\n2. ดื่มน้ำให้มาก, ไม่ดื่มน้ำเย็น\n3. ทำให้ร่างกายอบอุ่น\n4. กินอาหารอ่อน\n5. ใช้น้ำอุ่นเช็ดตัวเมื่อมีไข้สูง\n6. ให้ยาลดไข้แก้ปวด พาราเซตามอล 1 เม็ดเวลาปวด หรือมีไข้ ซ้ำได้ทุก ๆ 4-6 ชั่วโมง\n7. ถ้ามีไข้เกิน 7 วันหรือมีอาการเหนื่อยหอบให้ไปโรงพยาบาลเพื่อตรวจเพิ่มเติม",
  },
  "3": {
    "diseaseTitle": "หัด",
    "diseaseDetail": "การรักษา\n\n1. พักผ่อนให้เพียงพอ\n2. ดื่มน้ำให้มาก, ไม่ดื่มน้ำเย็น\n3. พักผ่อนให้เพียงพอ\n4. ทำให้ร่างกายอบอุ่น\n5. กินอาหารอ่อ\n6. ใช้น้ำอุ่นเช็ดตัวเมื่อมีไข้สูง\n7. ถ้าท้องเดิน ให้ผงน้ำตาลเกลือแร่ 1 ซองชงในน้ำ 1 แก้ว จิบบ่อย \n8. ไอมีเสมหะข้นเหลืองหรือเขียว ให้ยาปฏิชีวนะ อะม๊อกซี่ซิลลิน  เม็ด (500 มิลลิกรัม) วันละ 4 ครั้งหลังอาหาร และก่อนนอนนาน 7 วัน (สำหรับผู้ที่แพ้ยานี้ควรพบแพทย์เพื่อใช้ยาที่เหมาะสมต่อไป\n9. ถ้าไอมาก เหนื่อยหอบหรือ มีอาการท้องเดินมากให้ไปโรงพยาบาล",
  },
  "5": {
    "diseaseTitle": "ไข้ผื่นกุหลาบในทารก หรือส่าไข้",
    "diseaseDetail": "การรักษา\n\n1. ระยะมีไข้สูง ให้ดื่มน้ำมาก ๆ\n2. ใช้ผ้าชุบน้ำเช็ดตัวและให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง\n3. ถ้ามีไข้สูงมาก กินยาแล้วไม่ดีขึ้นให้ไปโรงพยาบาล เพราะอาจมีอาการชักจากไข้สูง\n4. ระยะผื่นขึ้น ไข้ลงแล้ว เด็กสบายดีไม่ต้องให้ยาอะไร\n5. กรณีจำเป็นจะยืนยันด้วยการทดสอบทางน้ำเหลือง ต้องตรวจในโรงพยาบาล",
  },
  "8": {
    "diseaseTitle": "ทอนซิลอักเสบ หรือคอหอยอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. พักผ่อนให้เพียงพอ\n2. ดื่มน้ำให้มาก ๆ, กลั้วคอด้วยน้ำเกลืออุ่น ๆ\n3. ในรายที่เกิดจากไวรัส ให้รักษาตามอาการ เช่น ยาลดไข้พาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง อาการจะดีขึ้นใน 1-2 สัปดาห์ \n4. ถ้าอาการไม่ดีขึ้นใน 3 วัน กินยาไม่ได้ เป็น ๆ หาย ๆ ให้ไปโรงพยาบาลเพื่อตรวจเพิ่มเติม\n5. ถ้าเป็นฝีทอลซิล อาจผ่าหรือเจาะเอาหนองออก\n6. ในรายเรื้อรังที่เป็นบ่อยมากกว่า 4 ครั้ง / ปี อาจต้องผ่าตัด\n7. ในรายที่เกิดจากเชื้อแบคทีเรียตองให้ยาปฏิชีวนะ อะม็อกซี่ซิลลิน (500 มิลลิกรัม) 1 เม็ด วันละ 4 ครั้ง หลังอาหารและก่อนนอน นาน 10 วัน (สำหรับผู้ที่แพ้ยานี้ ควรปรึกษาแพทย์เพื่อใช้ยาที่เหมาะสมต่อไป)",
  },
  "9": {
    "diseaseTitle": "อีดำอีแดง",
    "diseaseDetail": "การรักษา\n\n1. ให้ยาปฏิชีวนะ นาน 10วัน อะม็อกซี่ซิลลิน (500 มิลลิกรัม) 1 เม็ด วันละ 4 ครั้ง หลังอาหารและก่อนนอน นาน 10 วัน(สำหรับผู้ที่แพ้ยานี้ ควรปรึกษาแพทย์เพื่อใช้ยาที่เหมาะสมต่อไป)\n2. ถ้ามีไข้ให้กินยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง หรือเช็ดตัวลดไข้\n3. ควรแยกผู้ป่วยจนกว่าจะให้ยาปฏิชีวนะไปแล้ว 24 ชั่วโมง จึงจะไม่แพร่เชื้อให้ผู้อื่น\n4. ถ้ามีไข้สูงมาก, ทานอาหารไม่ได้ให้ไปโรงพยาบาล",
  },
  "11": {
    "diseaseTitle": "ครู้ป",
    "diseaseDetail": "การรักษา\n\n1. โรคนี้มักพบในเด็กเล็ก ถ้ามีอาการเล็กน้อยเช่น มีไข้ต่ำ ๆ ไอเสียงก้องบางครั้ง แต่ยังกินได้ ร่าเริงดี ให้ยาแก้ไข้ พาราเซตามอลชนิดน้ำ ให้ตามช่วงอายุ (ฉลากขวด) ซ้ำได้ทุก ๆ 4ชั่วโมง\n2. หลีกเลี่ยงควันบุหรี่ , ให้เด็กดื่มน้ำมาก ๆ\n3. ให้ความชื้นโดยวางอ่างน้ำไว้ข้างตัวเด็ก \n4. หากอาการกำเริบให้เด็กสูดไอน้ำอุ่นโดยใช้ผ้าขนหนูชุบน้ำอุ่นจัด ๆ บิดหมาดนำมาจ่อใกล้จมูกเด็ก\n5. สังเกตอาการใกล้ชิดทุกวัน ส่วนใหญ่อาการจะดีขึ้นใน 3-7 วัน\n6. หากหายใจลำบาก ปากเขียว ซึมลง กินไม่ได้ ให้นำส่งโรงพยาบาลทันที",
  },
  "13": {
    "diseaseTitle": "ไอกรน",
    "diseaseDetail": "การรักษา\n\n1. ให้เด็กอยู่ในที่ปลอดโปร่ง\n2. ดื่มน้ำอุ่นมาก ๆ\n3. ให้อาหารทีละน้อย แต่บ่อยครั้งเพื่อลดอาการอาเจียน\n4. ถ้าอาเจียนมาก ให้ผงน้ำตาลเกลือแร่ผสมน้ำ 1 แก้ว จิบบ่อย ๆ\n5. ให้ยาแก้ไอน้ำดำ ครั้งละ ½ -1 ช้อนชา วันละ 3-4 ครั้ง เพื่อระงับการไอ\n6. ถ้ามีอาการหอบเหนื่อยมาก หรืออาเจียนมาก กินไม่ได้ ให้ไปโรงพยาบาล\n7. โรคนี้มักจะไอเรื้อรังเป็นเดือน และจะค่อย ๆหายไปเอง\n8. โรคนี้ป้องกันได้โดยการฉีดวัคซีน ควรปรึกษาแพทย์โดยตรง",
  },
  "14": {
    "diseaseTitle": "วัณโรคปอด",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยโรคนี้ ควรไปตรวจเสมหะที่โรงพยาบาล ถ้าเป็นโรคนี้ต้องติดตามการรักษากับแพทย์อย่างสม่ำเสมอ ต่อเนื่องนาน  6 เดือน – 1 ปี\n2. ถ้ามีไข้ ให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4 ชั่วโมง\n3. ถ้าไอมาก ให้ยาแก้ไอน้ำดำ ครั้งละ 1 ช้อนชา วันละ 3-4 ครั้ง\n4. ควรแยกผู้ป่วย จนกระทั่งผลตรวจเสมหะไม่พบเชื้อ หรืออย่างน้อย 1 เดือนหลังจากรับยาวัณโรคแล้ว\n5. จัดห้องนอนของผู้ป่วยให้อากาศถ่ายเทสะดวก แสงแดดส่องถึง\n6. ควรบ้วนเสมหะลงในภาชนะที่มีฝาปิดมิดชิด แล้วนำไปเผาไฟหรือฝังดิน\n7. ถ้ามีอาการรุนแรง เช่น หอบมาก ไอมีเลือดปนกับเสมหะมาก ให้ไปโรงพยาบาล\n8. โรคนี้ป้องกันได้โดยการฉีดวัคซีนให้กับพวกทารกแรกเกิด",
  },
  "15": {
    "diseaseTitle": "หลอดลมอักเสบเฉียบพลัน",
    "diseaseDetail": "การรักษา\n\n1. พักผ่อนมากขึ้น\n2. ดื่มน้ำอุ่นให้มาก\n3. งดสูบบุหรี่\n4. หลีกเลี่ยงสิ่งระคายเคือง หรือสิ่งกระตุ้นให้มีการไอ เช่น น้ำเย็น ของทอด ฝุ่นควัน\n5. ถ้ามีไข้ ให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4 ชั่วโมง\n6. ถ้าไอมีเสมหะมาก ให้ยาขับเสมหะบรอมเฮกซีน 1 เม็ด วันละ 3 ครั้งหลังอาหาร เมื่ออาการทุเลาลง ควรหยุดยา\n7. ถ้ามีอาการไอมาก หรือมีอาการหอบเหนื่อย ให้ไปโรงพยาบาลเพื่อตรวจเพิ่มเติม",
  },
  "19": {
    "diseaseTitle": "ปอดอักเสบ หรือปอดบวม",
    "diseaseDetail": "การรักษา\n\n1. ถ้ามีไข้ ให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4 ชั่วโมง\n2. ให้ยาอะม็อกซี่ซิลลิน 500 มิลลิกรัม 4 เม็ด วันละ 4 ครั้งหลังอาหารและก่อนนอน นาน 10-14 วัน (สำหรับผู้ที่แพ้ยานี้ ควรปรึกษาแพทย์เพื่อใช้ยาที่เหมาะสมต่อไป)\n3. ควรติดตามอาการอย่างใกล้ชิด ถ้าไม่ดีขึ้นใน 3 วัน หรือมีอาการหอบรุนแรง ซี่โครงบุ๋ม ซึมลง ให้ไปโรงพยาบาล",
  },
  "20": {
    "diseaseTitle": "ภาวะมีหนองในโพรงเนื้อหุ้มปอด หรือภาวะมีน้ำในโพรงเนื้อหุ้มปอด",
    "diseaseDetail": "การรักษา\n\nถ้าพบมีอาการหายใจหอบเร็วกว่าปกติ, เจ็บแปลบเวลาหายใจ หรือรู้สึกแน่นหน้าอก หายใจเหนื่อยให้ไปโรงพยาบาลโดยเร็ว เพราะโรคนี้ต้องรักษาด้วยการเจาะระบายน้ำ หรือหนองออกจากช่องเยื่อหุ้มปอด และต้องเฝ้าระวังภาวะแทรกซ้อนรุนแรง จนกว่าอาการจะดีขึ้น",
  },
  "26": {
    "diseaseTitle": "ไซนัสอักเสบเฉียบพลัน",
    "diseaseDetail": "การรักษา\n\n1. ถ้าปวด หรือมีไข้ ให้ยาพาราเซตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง\n2. สโดเอฟี่ดรีน 1 เม็ด วันละ 3 ครั้งหลังอาหาร\n3. ดื่มน้ำมาก ๆ\n4. สูดดมไอน้ำอุ่น\n5. ล้างจมูกด้วยน้ำเกลือเพื่อระบายหนอง\n6. หากหายใจมีกลิ่นเหม็น น้ำมูกเป็นหนองให้ยา อะม็อกซี่ซิลลิน 1 เม็ด วันละ 4 ครั้งหลังอาหารและก่อนนอน\n7. ถ้ากินยาปฏิชีวนะ 3 วันแล้วอาการไม่ดีขึ้น หรืออาการรุนแรง หายใจไม่ออกให้ไปโรงพยาบาล อาจต้องเจาะล้างโพรงไซนัส",
  },
  "37": {
    "diseaseTitle": "ไทฟอยด์ หรือไข้รากสาดน้อย",
    "diseaseDetail": "การรักษา\n\n1. กินอาหารอ่อน ๆ\n2. ดื่มน้ำมาก ๆ \n3. เช็ดตัวเวลามีไข้สูง\n4. ให้ยาลดไข้พาราเซตตามอล 1 เม็ด ซ้ำได้ทุก ๆ 4-6 ชั่วโมง\n5. คลอแรมเฟนิคอล(250 มิลลิกรัม) 2 เม็ด วันละ 4 ครั้ง หลังอาหารและก่อนนอน นาน 14 วัน \n6. ถ้ากินยาปฏิชีวนะแล้ว 4-5 วัน อาการไม่ดีขึ้น หรืออ่อนเพลียมาก กินไม่ได้ให้ไปโรงพยาบาล",
  },
  "61": {
    "diseaseTitle": "เหงือกอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. ถ้าเป็นไม่มากใช้น้ำยาบ้วนปากที่ผสมยาฆ่าเชื้อโรค\n2. ถ้าปวดให้ยาพาราเซตตามอล 1 เม็ดเมื่อมีอาการซ้ำได้ทุก 4-6 ชั่วโมง\n3. ถ้าเหงือกบวมมีหนองให้ยาปฏิชีวนะอิริโทรมัยซิน 250 มิลลิกรัม 1 เม็ดวันละ 4 ครั้งหลังอาหารและก่อนนอนนาน 5 วัน\n4. แปลงฟันให้ถูกวิธีและดูแลความสะอาดในช่องปากอยู่เสมอ\n5. ถ้ากินยาแล้ว 3 วันแล้วยังไม่ดีขึ้นหรือเหงือกบวมมากมีหนองมากขึ้น กินไม่ได้อ้าปากไม่ได้ให้ไปโรงพยาบาลโดยเร็ว",
  },
  "64": {
    "diseaseTitle": "โรคพิษสุนัขบ้า",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่นมีไข้ เบื่ออาหาร ลุกลี้ลุกลนเมื่อมีสิ่งกระตุ้น กลัวน้ำ กลัวลมควรพบแพทย์ทันที โดยเฉพาะผู้ที่มีประวัติถูกสัตว์กัด ถ้าเป็นโรคนี้ต้องรับการรักษาในโรงพยาบาลเพราะมีความรุนแรงสูง\n2. เมื่อพบผู้ที่ถูกสัตว์กัดหรือข่วน ให้ฟอกล้างบาดแผลด้วยน้ำสะอาดกับสบู่หลายๆครั้งแล้วใส่ยาฆ่าเชื้อเบตาดีน และควรไปโรงพยาบาลเพื่อให้ผู้ป่วยได้รับการดูแลบาดแผลอย่างเหมาะสมและได้รับวัคซีนตามแผนการรักษา\n3. เฝ้าดูอาการสัตว์ที่เป็นต้นเหตุนาน 10 วันถ้าสัตว์นั้นปกติดีแสดงว่าความเสี่ยงในการติดเชื้อน้อย",
  },
  "65": {
    "diseaseTitle": "สมองอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. ให้ยาลดไข้พาราเซตตามอล 1 เม็ดเมื่อมีอาการซ้ำได้ทุก 4-6 ชั่วโมง ถ้าไม่ดีขึ้นยังมีไข้สูงต่อเนื่อง ซึมลง อาเจียนรุนแรง มีอาการคอแข็งหรือชักให้ไปโรงพยาบาลทันทีเพื่อให้ผู้ป่วยได้รับการดูแลรักษาที่เหมาะสมต่อไป\n2. ระมัดระวังอุบัติเหตุในขณะชัก\n3. โรคนี้ต้องได้รับการรักษาในโรงพยาบาลจนกว่าจะดีขึ้นและไม่มีภาวะแทรกซ้อนแล้วจึงจะกลับไปพักฟื้นที่บ้านได้",
  },
  "66": {
    "diseaseTitle": "เยื่อหุ้มสมองอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. ถ้ามีไข้ให้ยาพาราเซตตามอล 1 เม็ดเมื่อมีอาการซ้ำได้ทุก 4-6 ชั่วโมง\n2. ถ้ามีอาการคอแข็งในเด็กเล็กพบว่ากระหม่อมโป่งคือ มีอาการปวดศีรษะร่วมกับซึมลง สับสน แขนขาอ่อนแรงหรือชักเกร็งให้ไปโรงพยาบาลทันที",
  },
  "67": {
    "diseaseTitle": "บาดทะยัก",
    "diseaseDetail": "การรักษา\n\n1. หากพบว่ามีอาการขากรรไกรแข็ง อ้าปากไม่ได้ คอแข็งหรือชักเกร็งเป็นพักๆเวลามีสิ่งกระตุ้นให้ไปพบแพทย์ทันที เพราะต้องสังเกตอาการใกล้ชิดและให้การรักษาตามอาการที่ตรวจพบต่อไป\n2. โรคนี้สามารถป้องกันได้ด้วยการรับวัคซีนควรติดต่อแพทย์โดยตรง",
  },
  "68": {
    "diseaseTitle": "ชักจากไข้",
    "diseaseDetail": null,
  },
  "81": {
    "diseaseTitle": "เลือดออกในสมอง",
    "diseaseDetail": null,
  },
  "82": {
    "diseaseTitle": "ฝีสมอง",
    "diseaseDetail": "การรักษา\n\nถ้ามีไข้สูง ปวดศีรษะรุนแรง อาเจียนมาก ซึมลง สับสน เดินเซ แขนขาอ่อนแรงให้ไปโรงพยาบาลเพื่อตรวจหาสาเหตุทันทีเพราะโรคนี้ต้องรักษาด้วยการผ่าตัดระบายหนอง",
  },
  "95": {
    "diseaseTitle": "เยื่อบุหัวใจอักเสบเรื้อรัง",
    "diseaseDetail": "การรักษา\n\nถ้ามีไข้สูงมีจุดแดงขึ้นตามตัวมักพบว่ามีภาวะซีดและมีประวัติเป็นโรคหัวใจพิการแต่กำเนิดหรือมีประวัติเคยผ่าตัดหัวใจควรสงสัยโรคนี้และไปตรวจที่โรงพาบาลโดยเร็วเพราะโรคนี้ต้องรับการรักษาในโรงพยาบาลเพื่อรับยาปฏิชีวนะแบบฉีดอย่างต่อเนื่องและเฝ้าระวังภาวะแทรกซ้อนรุนแรงจนกว่าอาการจะดีขึ้น",
  },
  "111": {
    "diseaseTitle": "แอสแอลอี",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยควรพบแพทย์โดยเร็ว\n2. ในรายไม่รุนแรงอาจให้ยานาโพรเซน 250 มิลลิกรัมวันละ 2 ครั้งหลังอาหารเมื่ออาการทุเลาควรหยุดยา\n3. ถ้าอาการไม่ดีขึ้นหรือมีอาการรุนแรงให้ไปโรงพยาบาลเพื่อตรวจเพิ่มเติม\n4. ผลการรักษาไม่แน่นอนขึ้นอยู่กับความรุนแรงของโรคผู้ป่วยจึงต้องติดตามการรักษากับแพทย์อย่างต่อเนื่อง\n5. ผู้ป่วยมักมีภูมิคุ้มกันต่ำจึงควรหลีกเลี่ยงสถานที่แออัด",
  },
  "136": {
    "diseaseTitle": "หน่วยไตอักเสบเฉียบพลัน",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่นมีอาการบวมที่หน้าหรือหนังตาบวม มีไข้ ปัสสาวะสีน้ำล้างเนื้อควรพบแพทย์เพื่อตรวจเพิ่มเติม\n2. ถ้าเป็นโรคนี้ต้องรักษาในโรงพยาบาลเนื่องจากมีภาวะแทรกซ้อนที่รุนแรง\n3. พักผ่อนให้เพียงพอ งดอาหารเค็ม ส่วนใหญ่จะดีขึ้นภายใน 2-3 สัปดาห์และต้องติดตามอาการกับแพทย์ตามนัดอยู่เสมอ",
  },
  "137": {
    "diseaseTitle": "กรวยไตอักเสบ หรือกรวยไตอักเสบเฉียบพลัน",
    "diseaseDetail": "การรักษา\n\n1. ถ้าอาการไม่รุนแรงเช่น มีไข้ ปวดเอว ปัสสาวะขุ่น ให้ยาไซโพรฟล็อกซาซิน 500 มิลลิกรัมวันละ 2 ครั้งหลังอาหารนาน 14 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)\n2. ถ้าปวดหรือมีไข้ให้ยาพาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมง\n3. ให้ดื่มน้ำมากๆเพื่อช่วยขับเชื้อโรคออกจากร่างกาย\n4. ถ้าอาการไม่ดีขึ้นหลังจากกินยาแล้ว 3 วันหรือมีไข้สูงตลอดเวลา ปวดเอวมากหรือปัสสาวะมีเลือดปนควรพบแพทย์โดยเร็วเพื่อตรวจเพิ่มเติม",
  },
  "163": {
    "diseaseTitle": "หูชั้นกลางอักเสบ หรือหูชั้นกลางอักเสบเฉียบพลัน",
    "diseaseDetail": "การรักษา\n\n1. ถ้าปวดให้ยาแก้ปวดพาราเซตตามอล 1 เม็ดเมื่อมีอาการซ้ำได้ทุก 4-6 ชั่วโมง\n2. ให้ยาอะม็อกซีซิลลิน (500 มก.) 1 เม็ดวันละ 4 ครั้งหลังอาหารและก่อนนอนนาน 10 วัน(ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)\n3. ถ้ากินยาแล้ว 3 วันไม่ดีขึ้นหรือปวดหูรุนแรงหรือมีหนองไหลจากหูควรพบแพทย์เพื่อตรวจเพิ่มเติม",
  },
  "192.1": {
    "diseaseTitle": "ฝี",
    "diseaseDetail": "การรักษา\n\n1. ใช้ผ้าชุบน้ำอุ่นจัดๆประคบครั้งละ 10–15 นาทีวันละ 2 ครั้ง\n2. ให้กินยาแก้ปวดลดไข้พาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมง\n3. ให้ยาปฏิชีวนะไดคล็อกซาซิลลิน 500 มก.วันละ 4 ครั้งก่อนอาหารและก่อนนอนนาน 7 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง) \n4. ถ้าฝีสุกและหนองแตกออกมาให้ล้างแผลโดยใช้สำลีชุบน้ำเกลือสำหรับล้างแผลเช็ดหนองออกให้หมดและใส่ยาเบตาดีน ควรล้างแผลทุกวันจนกว่าแผลจะหายสนิท\n5. ถ้าไม่ดีขึ้นหรือแผลอักเสบลุกลามควรพบแพทย์เพื่อตรวจเพิ่มเติม",
  },
  "192.2": {
    "diseaseTitle": "แผลพุพอง",
    "diseaseDetail": "การรักษา\n\n1. อาบน้ำฟอกสบู่วันละ 2 ครั้งและดูแลผิวหนังให้แห้งสะอาดอยู่เสมอ\n2. ถ้าแผลมีสะเก็ดแข็งให้ประคบด้วยน้ำอุ่นจัดๆและชุ่มๆเพื่อให้สะเก็ดนุ่มและหลุดออกเร็ว\n3. ทาแผลด้วยขี้ผึ้งเตตราไซคลีน (Tetracycline ointment) หลังอาบน้ำทุกครั้ง\n4. ถ้าคันมากให้ยาแก้แพ้คลอเฟนิรามีน (Chlorpheniramine) 1 เม็ดวันละ 3 ครั้งหลังอาหารถ้าไม่มีอาการคันแล้วให้หยุดยาได้\n5. ให้ยาปฏิชีวนะอิริโทรไมซิน (Erythromycin) 500 มก.วันละ 4 ครั้งหลังอาหารและก่อนนอนนาน 10 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)",
  },
  "192.3": {
    "diseaseTitle": "แผลอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. ชะล้างแผลด้วยน้ำเกลือสำหรับล้างแผลกรณีแผลไม่มีหนอง\n2. ถ้าเป็นหนองเฟะ ควรชะล้างด้วยไฮโดรเจนเพอร์ออกไซด์ก่อนและล้างออกด้วยน้ำเกลือสำหรับล้างแผลแล้วใส่ยาเบตาดีน ปิดแผลด้วยผ้าก๊อชสะอาด\n3. ควรทำแผลอย่างน้อยวันละ 1-2 ครั้งทำแผลทุกวันจนกว่าแผลจะหายสนิท\n4. ถ้ามีไข้ให้กินยาแก้ปวดลดไข้พาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมง\n5. ถ้าแผลสกปรกมากหรือมีการอักเสบมากให้ยาปฏิชีวนะไกคล็อกซาซิลลิน 500มก.วันละ 4 ครั้งก่อนอาหารและก่อนนอนนาน 7 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)\n6. ระวังอย่าให้แผลถูกน้ำถ้าแผลชุ่มควรล้างแผลทันที\n7. ถ้าแผลไม่ดีขึ้นหรือลุกลามอักเสบมากขึ้นควรพบแพทย์เพื่อตรวจเพิ่มเติม",
  },
  "192.4": {
    "diseaseTitle": "เนื้อเยื่อใต้ผิวหนังชั้นลึกอักเสบ",
    "diseaseDetail": "การรักษา\n\n1. พักการใช้งานแขน ขาข้างที่มีการอักเสบ ถ้าบวมมากให้ยกส่วนที่อักเสบให้สูงโดยใช้หมอนรองและใช้น้ำอุ่นจัดๆประคบ\n2. ควรกินอาหารพวกโปรตีนเพิ่มขึ้น\n3. ถ้ามีไข้ให้กินยาแก้ปวดลดไข้พาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมง\n4. ให้ยาปฏิชีวนะออกเมนทิน (Augmentin) 1 กรัมวันละ 2 ครั้งหลังอาหารนาน 10 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)\n5. ถ้าไม่ดีขึ้นภายใน 3-5 วันหรือแผลอักเสบลุกลามมากขึ้นมีไข้ควรพบแพทย์โดยเร็วเพื่อตรวจเพิ่มเติมและเฝ้าระวังภาวะโลหิตเป็นพิษจากการติดเชื้อเข้ากระแสโลหิต",
  },
  "192.5": {
    "diseaseTitle": "ไฟลามทุ่ง",
    "diseaseDetail": "การรักษา\n\n1. พยายามอย่าเคลื่อนไหวส่วนที่อักเสบใช้น้ำอุ่นจัดๆประคบและยกส่วนที่อักเสบให้สูงโดยใช้หมอนรอง\n2. ควรกินอาหารพวกโปรตีนเพิ่มขึ้น\n3. ถ้ามีไข้ให้กินยาแก้ปวดลดไข้พาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมง\n4. ให้ยาปฏิชีวนะออกเมนทิน (Augmentin) 1 กรัมวันละ 2 ครั้งหลังอาหารนาน 10 วัน (ผู้ที่แพ้ยานี้ควรปรึกษาแพทย์โดยตรง)\n5. ถ้าไม่ดีขึ้นภายใน 3-5 วันหรือแผลอักเสบลุกลามมากขึ้นมีไข้ควรพบแพทย์โดยเร็ว",
  },
  "218.1": {
    "diseaseTitle": "โรคลมจากความร้อน",
    "diseaseDetail": "การรักษา\n\n1. ถ้าผู้ป่วยมีไข้สูง ชีพจรเต้นเร็ว อาจมีพูดจาสับสน เดินเซและมีประวัติอยู่ในที่มีอากาศร้อนมากนานๆหรือหลังออกกำลังกายอย่างหนัก ให้พาผู้ป่วยหลบเข้าที่ร่ม อากาศถ่ายเทดี หยุดออกกำลังกาย\n2. ปลดเสื้อผ้าให้หลวม ใช้ผ้าชุบน้ำเช็ดตัว วางถุงน้ำแข็งไว้ตามซอกคอ รักแร้ ขาหนีบ เปิดพัดลมเบาๆ ถ้าตัวเย็นลงให้หยุดเช็ดตัวใส่เสื้อผ้าบางๆได้\n3. ให้ดื่มผงน้ำตาลเกลือแร่ 1 ซองผสมน้ำ 1 แก้วให้ดื่ม 1-2 แก้วอาการควรจะดีขึ้นภายใน 2-3 ชม.\n4. ถ้าอาการไม่ดีขึ้นภายใน 2-3 ชม.หรืออ่อนเพลียมาก กินไม่ได้หรือไข้ไม่ลดควรพบแพทย์โดยเร็วเพื่อตรวจเพิ่มเติม",
  },
  "224": {
    "diseaseTitle": "มาลาเรีย",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่น มีอาการไข้สูง หนาวสั่นเป็นๆหายๆ เบื่ออาหาร อ่อนเพลียและมีประวัติอาศัยอยู่ในเขตป่าเขา หรือกลับจากเขตป่าหรือถูกยุงในป่ากัดควรไปตรวจที่โรงพยาบาลเพราะโรคนี้จะยืนยันด้วยการเจาะเลือดตรวจหาเชื้อและต้องได้รับยารักษาตามชนิดของเชื้อที่พบ \n2. ผู้ป่วยควรกินยาให้ครบตามแพทย์สั่ง ถ้าไม่ครบจะมีโอกาสเป็นไข้มาลาเรียกำเริบได้อีกและควรเฝ้าสังเกตอาการอย่างใกล้ชิดเพราะอาจเป็นมาลาเรียดื้อยาหรือมาลาเรียขึ้นสมองได้ หากสงสัยควรกลับไปพบแพทย์โดยเร็วเพื่อตรวจเพิ่มเติม",
  },
  "225": {
    "diseaseTitle": "ไข้เลือดออก",
    "diseaseDetail": "การรักษา\n\n1. ถ้าอาการไม่รุนแรงเช่น มีไข้ ปวดศีรษะ เบื่ออาหาร โดยไม่มีเลือดออกผิดปกติหรือมีภาวะช๊อก ควรให้การรักษาตามอาการ\n - ถ้ามีไข้สูงให้ยาพาราเซตตามอล 1 เม็ดซ้ำได้ทุก 4-6 ชั่วโมงร่วมกับการเช็ดตัวลดไข้บ่อยๆเพราะถึงแม้ให้ยาลดไข้แล้วไข้อาจไม่ลดลง ไม่ควรให้ยาลดไข้ถี่กว่านี้อาจมีพิษต่อตับและไม่ควรให้ยาแอสไพรินเพราะอาจทำให้เลือดออกง่ายขึ้น\n - ให้อาหารอ่อนๆเช่น โจ๊ก นม น้ำหวาน\n - ให้ดื่มน้ำมากๆจนปัสสาวะออกมากและใส อาจเป็นน้ำผลไม้หรือผงน้ำตาลเกลือแร่ 1 ซองชงกับน้ำ 1 แก้วจิบบ่อยๆ อาการมักจะดีขึ้นภายใน 1 สัปดาห์และฟื้นตัวได้ดี\n2. ถ้ามีอาการรุนแรงเช่น อาเจียนมากกินไม่ได้ ปัสสาวะออกน้อยลง มีภาวะช๊อกหรือมีเลือดออกผิดปกติให้ไปโรงพยาบาลโดยเร็วเพื่อตรวจเพิ่มเติมและเฝ้าระวังภาวะแทรกซ้อนที่อาจเกิดขึ้นได้",
  },
  "226": {
    "diseaseTitle": "สครับไทฟัส",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่น มีอาการไข้สูงโดยไม่ทราบสาเหตุ มักมีประวัติเข้าไปในป่าหรือในสวน อาจตรวจพบสะเก็ดแผลไหม้จากตัวไรอ่อนกัด มีลักษณะเหมือนถูกบุหรี่จี้ซึ่งเป็นลักษณะของโรคนี้ ควรไปตรวจที่โรงพยาบาลเพราะโรคนี้จะยืนยันด้วยการเจาะเลือดตรวจ\n2. ถ้าเป็นโรคนี้อาจต้องรักษาในโรงพยาบาล ในระยะแรกต้องได้รับยาฉีดและเฝ้าระวังภาวะแทรกซ้อนเมื่ออาการทุเลาจึงกลับไปกินยาต่อที่บ้านจนครบตามแพทย์สั่ง",
  },
  "227": {
    "diseaseTitle": "เล็ปโตสไปโรซิส หรือไข้ฉี่หนู",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่น มีไข้สูง ปวดศีรษะ คลื่นไส้อาเจียน ปวดกล้ามเนื้อ มักมีประวัติเดินลุยน้ำหรือแช่น้ำที่ท่วมขังในบริเวณต่างๆ ควรไปตรวจที่โรงพยาบาลเพราะต้องยืนยันด้วยการเจาะเลือดตรวจ\n2. ถ้าเป็นโรคนี้ต้องรับการรักษาในโรงพยาบาลเนื่องจากต้องรับยาฉีดและเฝ้าระวังภาวะแทรกซ้อนรุนแรงที่อาจเกิดขึ้นได้\n3. หลีกเลี่ยงการเดินย่ำน้ำที่ท่วมขังหรือพื้นดินที่ชื้นแฉะ ถ้าจำเป็นให้ใส่รองเท้าที่สูงหุ้มข้อเพื่อป้องกันการได้รับเชื้อโรค",
  },
  "237.6": {
    "diseaseTitle": "มะเร็งปอด",
    "diseaseDetail": "การรักษา\n\n1. หากสงสัยเช่น ไอเรื้อรัง ไอมีเลือดปน หรือไอออกมาเป็นเลือดสด เจ็บอก อ่อนเพลีย หายใจเหนื่อย ควรพบแพทย์เพื่อตรวจเพิ่มเติม\n2. โรคนี้แพทย์จะให้การรักษาด้วยการผ่าตัด รังสีบำบัดหรือเคมีบำบัด ขึ้นกับชนิดและระยะของมะเร็งที่พบเนื่องจากโรคนี้มักจะลุกลามเร็ว ผลการรักษาจึงไม่สู้ดี\n3. หลีกเลี่ยงการสัมผัสควันบุหรี่ สารใยหิน และมลพิษทางอากาศเพื่อลดความเสี่ยงในการเกิดโรคนี้",
  },
};
