Map<int, dynamic> mainFlowChartLanguage = {
  1: {
    "nameFlowChart": "ไข้",
    "definitionsFlowChart": "ตัวร้อน อุณหภูมิของร่างกายสูงกว่า 37.2ºซ. (เมื่อวัดทางปาก) 36.7ºซ. (เมื่อวัดทางรักแร้) หรือ 37.7ºซ. (เมื่อวัดทางทวารหนัก)",
    "questionFlowChart": <String, String>{
      "1.0": "มีอาการใดดังต่อไปนี้?",
      //(1.0, 1.1, 1.2, 1.3, 1.6, 2.0, 4.1, 4.2, 4.3, 4.4, 4.5, 5.0, 5.1, 5.2, 5.3. 5.4, 5.5, 6.0, 7.0, 8.0, 11.0, 11.1, 14.0, 15.0, 16.2, 16.4)
      "1.4": "ทำงานหรือออกกำลังกาย ท่ามกลางอากาศร้อน?",
      "1.5": "รู้สึกตัวดี?",
      "1.7": "เด็กอายุ 6 เดือน ถึง 5 ปี มีอาการชักชั่วขณะหนึ่ง (ไม่เกิน 15 นาที) แล้วหยุดชักได้เอง?",
      "3.0": "แขนขาอ่อนแรงเกิดขึ้นฉับพลัน?",
      "4.0": "มีไข้นานเกิน 1 เดือน?",
      "9.0": "มีรอยแผลเหมือนถูกบุหรี่จี้?",
      "9.1": "มีประวัติเคยเข้าไปในป่าดง หรือไร่สวนภายในระยะ 3 สัปดาห์ที่ผ่านมา?",
      "10.0": "เท้าบวม 2 ข้าง?",
      "10.1": "ปัสสาวะสีแดงเหมือนน้ำล้างเนื้อ?",
      "12.0": "เหงือกบวมอักเสบเป็นหนอง?",
      "13.0": "มีอาการอักเสบที่ผิวหนัง?",
      "16.0": "ไข้สูงตลอดเวลา?",
      "16.1": "การทดสอบทูร์นิเคต์ เบื้องต้นใช้หนังยางรัดเหนือข้อศอกให้แน่นพอสมควร ประมาณ 5 นาทีและเอาเหรียญบาทกดทับที่ท้องแขนถ้าพบว่ามีจุดแดง ๆ ในบริเวณที่เหรียญทับมากกว่า 10 จุด แสดงว่าให้ผลเป็นบวก",
      "16.3": "มีอาการในเด็กอายุต่ำกว่า 3 ปี?",
    },
    "multiAnswerSelectTextList": <String, List<String>>{
      "1.0": ["ไม่ค่อยรู้สึกตัว?", "ปวดศรีษะมาก?", "อาเจียนรุนแรง?", "ชัก?"],
      "1.1": ["มีอาการคอแข็ง?", "เด็กเล็กมีกระหม่อมโป่งตึง?"],
      "1.2": ["เคยเข้าไปในดงมาลาเรีย?", "ได้รับการถ่ายเลือดภายในระยะหลายเดือนที่ผ่านมา?"],
      "1.3": ["เคยถูกสุนัขหรือแมว กัด ข่วน?", "มีอาการกลัวน้ำ?", "มีอาการกลัวลม?"],
      "1.6": ["อ้าปากไม่ได้?", "หลังแอ่น?", "มีอาการเกร็งเวลาสัมผัสถูกหรือถูกแสงสว่างหรือเสียงดัง?"],
      "2.0": ["เหงื่อออก?", "ตัวเย็น?", "กระสับกระส่าย?"],
      "4.1": ["มีอาการไอ?", "และน้ำหนักลดฮวบ?"],
      "4.2": ["ปวดข้อนิ้วมือ 2 ข้าง?", "ผมร่วง?", "มีผื่นปีกผีเสื้อที่ข้างจมูก?"],
      "4.3": ["จับไข้หนาวสั่นวันเว้นวัน?", "เคยไปในดงมาลาเรีย?"],
      "4.4": ["มีจุดแดงที่เยื่อบุตา?", "มีจุดแดงที่ใต้เล็บ?", "รู้สึกเจ็บแน่นใต้ชายโครงซ้าย?"],
      "4.5": ["มีจุดแดงจ้ำเขียวขึ้นตามตัว?", "มีก้อนบวมที่ข้างคอ หรือรักแร้?"],
      "5.0": ["มีไข้เกิน 7 วัน?", "หนาวสั่นมาก (เมื่อห่มผ้าหนา ๆ)?"],
      "5.1": ["พบรอยแผลเหมือนถูกบุหรี่จี้?", "มีผื่นขึ้นที่หลัง?", "มีไข้ 5-7 วัน?", "มีประวัติเคยเข้าไปในป่าดง หรือไร่สวน ภายในระยะ 3 สัปดาห์ที่ผ่านมา?"],
      "5.2": ["จับไข้หนาวสั่นวันละครั้ง หรือวันเว้นวัน?", "มีประวัติเคยเข้าไปในดงมาลาเรีย?", "ได้รับการถ่ายเลือดภายในระยะหลายเดือนที่ผ่านมา?"],
      "5.3": ["เจ็บที่สีข้าง?", "ปัสสาวะขุ่น?"],
      "5.4": ["บีบน่องรู้สึกปวดมาก?", "ตาแดง?", "ตาเหลือง?", "มีอาชีพที่ต้องย่ำน้ำ?", "อยู่ในละแวกที่มีการระบาดของเล็ปโตสไปโรซิส?"],
      "5.5": ["ไข้สูงตลอดเวลา?" "อยู่ในละแวกที่มีการระบาดของไทฟอยด์?"],
      "6.0": ["มีอาการหอบ หรือหายใจเร็วกว่าปกติ", "มีอาการปวดท้องรุนแรงหรือกดเจ็บท้องมาก"],
      "7.0": ["อาการซีด?", "ตัวเหลืองตาเหลือง?", "มีจุดแดงหรือจ้ำเขียวขึ้นตามตัว?", "ปวดข้อรุ่นแรงหรือข้อบวมแดงร้อน?", "ปวดหลังรุ่นแรง?"],
      "8.0": ["มีอาการเจ็บหน้าอกแปลบเวลาหายใจเข้าลึก ๆ?", "เจ็บหน้าอกมาก?"],
      "11.0": ["ทอนซิลโตแดง?", "เป็นหนอง?"],
      "11.1": ["มีผื่นแดงขึ้นทั่วตัวหลังมีไข้ 1-2 วัน?", "ลิ้นเป็นสีแดงและมีฝ้าขาวคล้ายผลสตรอว์เบอร์รี?"],
      "14.0": ["มีไข้สูง?", "อ่อนเพลีย?", "คลื่นไส้ อาเจียน?", "ปวดศีรษะ?", "เวียนศีรษะ?", "ทำงานหรือออกกำลังกายท่ามกลางอากาศร้อน?"],
      "15.0": ["มีน้ำมูก?", "อาการไอ?", "มีผื่นหรือตุ่มขึ้น?", "ปากเจ็บหรือแผลที่ปาก?", "คางบวม?", "คอบวม?", "ถ่ายเป็นน้ำรุนแรง?", "ปัสสาวะแสบขัด?"],
      "16.2": ["หน้าแดง?", "เปลือกตาแดง?"],
      "16.4": ["คลำพบก้อนใต้ชายโครงขวา?", "รู้สึกเจ็บแน่นใต้ชายโครงซ้าย?", "อยู่ในละแวกที่มีการระบาดของไทฟอยด์?"],
    },
    "commandHealthDetailList": <String, String>{
      "1.1": "ถ้ายังไม่หยุดชัก ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      //(1.1, 1.2, 1.3)
      "1.7-1": "ถ้าชักนานเดิน 15 นาที หรือชักซ้ำภายใน 24 ชั่วโมง หรือชักเป็นครั้งแรก ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "1.7-2": "ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      //(1.7-2, 2.0, 4.1, 4.5-1, 4.5-2, 5.5-2, 9.1-2, 10.1)
      "5.1": "ถ้าไม่ดีขึ้นใน 3 วัน หรือไม่ค่อยรู้สึกตัว หอบ หรือถ่ายอุจจาระดำ ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      //(5.1, 9.1-1)
      "5.2": "ถ้าไม่ดีขึ้นใน 3 วัน หรือมีอาการไม่ค่อยรู้สึกตัว ชัก หอบ ซีด หรือตัวเหลืองตาเหลือง ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "5.3": "ถ้าไม่ดีขึ้นใน 3 วัน หรือมีอาการซีด ตัวเหลืองตาเหลือง หรือมีจุดแดงจ้ำเขียว ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "5.5-1": "ถ้าไม่ดีขึ้นใน 4 วัน หรือมีอาการหอบ คอแข็ง ปวดท้องรุนแรง ซีด ตัวเหลืองตาเหลือง ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "8.0": "ถ้ามีอาการหอบ มีไข้เกิน 4 วัน หรืออาการไม่ดีขึ้นใน 48 ชั่วโมง ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "11.1-1": "ถ้าไม่ดีขึ้น ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      //(11.1-1, 11.1-2, 12.0)
      "13.0": "ถ้าไม่ดีขึ้นใน 3 วัน หรือเป็นหลังกินหอยนางรมดิบ หรือหลังเล่นน้ำทะเล ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "14.0": "ปฐมพยาบาลโดยด่วนหากทำได้ และนำส่งโรงพยาบาล",
      "16.1": "รักษาตามอาการที่พบ ถ้าไม่ดีขึ้นใน 4 วัน หรือมีอาการหอบ ชัก ไม่ค่อยรู้สึกตัว ปวดท้องมาก อาเจียน กินไม่ได้ มีเลือดออก ช็อก ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      //(16.1, 16.2, 16.3)
      "16.4": "ถ้าไม่ดีขึ้นใน 4 วัน หรือมีอาการหอบ คอแข็ง ปวดท้องรุนแรง ซีด หรือตัวเหลืองตาเหลือง ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "17.0": "ถ้าไม่ดีขึ้นใน 4 วัน หรือมีไข้เกิน 7 วัน ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ"
    },
    "commandHealthDrugRcommendList": <String, List<String>>{
      "1.7-1": ["ยาลดไข้ หรือยาพาราเซตามอล"],
      "5.1": ["ยาลดไข้"],
      //(5.1, 5.2, 5.3, 5.5-1, 8.0, 9.1-1, 11.1-1, 11.1-2, 12.0, 16.4)
      "16.1": ["ยาพาราเซตามอล"],
      //(16.1, 16.2, 16.3)
      "17.0": ["ยาลดไข้ หรือยาพาราเซตามอล"],
    },
    "commandHealthTreatmentRecommendList": <String, List<String>>{
      "16.1": ["ดูแลอาการใกล้ชิดทุกวัน"],
      //(16.1, 16.2, 16.3)
    },
    "symptomaticTreatmentDescription": <String, String>{},
    "symptomaticTreatmentRecommend": <String, List<String>>{
      "17.0": ["นอนพักผ่อน", "ดื่มน้ำเปล่ามาก ๆ", "ใช้ผ้าชุบน้ำเช็ดตัวบ่อย ๆ", "ห้ามอาบน้ำเย็น", "รับประทานยา"],
    }
  },
  2: {
    "nameFlowChart": "ไข้ร่วมกับน้ำมูกหรือไอ",
    "definitionsFlowChart": "ตัวร้อน อุณหภูมิของร่างกายสูงกว่า 37.2ºซ. (เมื่อวัดทางปาก) 36.7ºซ. (เมื่อวัดทางรักแร้) หรือ 37.7ºซ. (เมื่อวัดทางทวารหนัก) และมีน้ำมูกไหล หรือไอ",
    "questionFlowChart": <String, String>{
      "1.0": "หอบ (หายใจลำบาก)?",
      "2.0": "มีอาการใดดังต่อไปนี้?",
      //(2.0, 3.0, 6.0, 7.0, 8.0, 9.0 ,10.0, 11.1 ,13.0)
      "4.0": "ไอเป็นเลือด?",
      "5.0": "่ไอมีเสลดเหลือง หรือเขียว?",
      "11.0": "ไข้สูงตลอดเวลา?",
      "12.0": "น้ำมูกเหลืองข้น หรือเขียวเกิน 24 ชั่วโมง?",
    },
    "multiAnswerSelectTextList": <String, List<String>>{
      "2.0": ["เจ็บหน้าอกมาก?", "เจ็บแปลบที่หน้าอกเวลาหายใจเข้าลึก?"],
      "3.0": ["น้ำหนักลดฮวบ?", "มีไข้เกิน 7 วัน?"],
      "6.0": ["ไอเสียงก้อง?", "หายใจเข้ามีเสียงฮี้ด?"],
      "7.0": ["ปวดหู?", "หูอื้อ?"],
      "8.0": ["กดเจ็บบริเวณโหนกแก้ม?", "กดเจ็บบริเวณหน้าผาก?", "กดเจ็บบริเวณรอบกระบอกตา?"],
      "9.0": ["ทอนซิลโตแดง?", "ทอนซิลเป็นหนอง?"],
      "10.0": ["เด็กไม่ได้ฉีดวัคซีนป้องกันโรคไอกรน?", "มีประวัติใกล้ชิดกับเด็กที่เป็นไอกรน?"],
      "11.1": ["หน้าแดง?", "เปลือกตาแดง?", "พบจุดสีขาวคล้ายเม็ดงาในกระพุงแก้ม?"],
      "13.0": ["ปวดเมื่อยมาก?", "มีประวัติสัมผัสกับผู้ป่วยไข้หวัดใหญ่?"]
    },
    "commandHealthDetailList": <String, String>{
      "5.0": "ถ้าไม่ดีขึ้นภายใน 48 ชั่วโมง หรือมีอาการหอบตามมา ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "6.0": "ถ้ามีอาการหอบ กลืนลำบาก ซึม กระสับกระส่าย ขาดน้ำ มีแผ่นเยื่อสีเทา หรือสีเหลืองปนเทาในลำคอ ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "9.0": "ถ้าดีขึ้นใน 3 วัน กินยาปฏิชีวนะจนครบ 10 วัน หรือถ้าไม่ดีขึ้นใน 3 วัน ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "10.0": "ถ้าไข้ไม่ลดใน 4 วัน หรือมีอาการหอบ ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "11.1-1": "ถ้าไม่ดีขึ้นใน 4 วัน หอบ ชัก ไม่ค่อยรู้สึกตัว หรือท้องเดินรุนแรง ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "11.1-2": "ถ้าไม่ดีขึ้นใน 4 วัน หรือหอบ ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "12.0": "ถ้าไข้ไม่ลดใน 4 วัน หอบ เจ็บหน้าอกมาก มีประวัติสัมผัสสัตว์ปีกที่ป่วยหรือตาย หรือสัมผัสผู้ป่วยไข้หวัดนก ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ",
      "13.0-1": "รักษาตามอาการที่พบ ถ้าไข้ไม่ลดใน 4 วัน หอบ หรือเจ็บหน้าอกมาก ควรไปโรงพยาบาลเพื่อตรวจหาสาเหตุ"
      //(13.0-1, 13.0-2)
    },
    "commandHealthDrugRcommendList": <String, List<String>>{
      "5.0": ["ยาพาราเซตามอล"],
      //(5.0, 6.0, 11.1-1, 11.1-2, 12.0, 13.0-1, 13.0-2)
      "7.0": ["ยาลดไข้"],
      //(7.0, 8.0, 9.0, 10.0)
    },
    "commandHealthTreatmentRecommendList": <String, List<String>>{
      "6.0": ["ดื่มน้ำมาก ๆ", "สูดไอน้ำอุ่น"],
      "13.0-1": ["นอนพักผ่อน", "ดื่มน้ำมาก ๆ", "ถ้าไอเพียงเล็กน้อยให้จิบน้ำอุ่นบ่อย ๆ", "รับประทานยา"]
    },
    "symptomaticTreatmentDescription": <String, String>{},
    "symptomaticTreatmentRecommend": <String, List<String>>{
      "11.1-2": ["รับประทานยา"],
    },
  },
};
